In [ ]:
#pandas -> by Wes Mcckinny

In [4]:
import pandas as pd

In [2]:
help(pd)

Help on package pandas:

NAME
    pandas

DESCRIPTION
    pandas - a powerful data analysis and manipulation library for Python
    =====================================================================

    **pandas** is a Python package providing fast, flexible, and expressive data
    structures designed to make working with "relational" or "labeled" data both
    easy and intuitive. It aims to be the fundamental high-level building block for
    doing practical, **real world** data analysis in Python. Additionally, it has
    the broader goal of becoming **the most powerful and flexible open source data
    analysis / manipulation tool available in any language**. It is already well on
    its way toward this goal.

    Main Features
    -------------
    Here are just a few of the things that pandas does well:

      - Easy handling of missing data in floating point as well as non-floating
        point data.
      - Size mutability: columns can be inserted and deleted from DataFrame and
        higher dimensional objects
      - Automatic and explicit data alignment: objects can be explicitly aligned
        to a set of labels, or the user can simply ignore the labels and let
        `Series`, `DataFrame`, etc. automatically align the data for you in
        computations.
      - Powerful, flexible group by functionality to perform split-apply-combine
        operations on data sets, for both aggregating and transforming data.
      - Make it easy to convert ragged, differently-indexed data in other Python
        and NumPy data structures into DataFrame objects.
      - Intelligent label-based slicing, fancy indexing, and subsetting of large
        data sets.
      - Intuitive merging and joining data sets.
      - Flexible reshaping and pivoting of data sets.
      - Hierarchical labeling of axes (possible to have multiple labels per tick).
      - Robust IO tools for loading data from flat files (CSV and delimited),
        Excel files, databases, and saving/loading data from the ultrafast HDF5
        format.
      - Time series-specific functionality: date range generation and frequency
        conversion, moving window statistics, date shifting and lagging.

PACKAGE CONTENTS
    _config (package)
    _libs (package)
    _testing
    _typing
    _version
    api (package)
    arrays (package)
    compat (package)
    conftest
    core (package)
    errors (package)
    io (package)
    plotting (package)
    testing
    tests (package)
    tseries (package)
    util (package)

SUBMODULES
    _hashtable
    _lib
    _tslib
    offsets

FUNCTIONS
    __getattr__(name)

DATA
    IndexSlice = <pandas.core.indexing._IndexSlice object>
    NA = <NA>
    NaT = NaT
    __docformat__ = 'restructuredtext'
    __git_version__ = 'b687cd4d9e520666a956a60849568a98dd00c672'
    describe_option = <pandas._config.config.CallableDynamicDoc object>
    get_option = <pandas._config.config.CallableDynamicDoc object>
    options = <pandas._config.config.DictWrapper object>
    reset_option = <pandas._config.config.CallableDynamicDoc object>
    set_option = <pandas._config.config.CallableDynamicDoc object>

VERSION
    1.0.5

FILE
    /Users/amandeep/opt/anaconda3/lib/python3.8/site-packages/pandas/__init__.py

In [10]:
a = pd.Series([10,11,12,13,14], index=["a","b",100.11,"d","e"])

In [11]:
a

a         10
b         11
100.11    12
d         13
e         14
dtype: int64

In [12]:
a["b"]

11

In [13]:
a[3]

13

In [5]:
df = pd.DataFrame([1,2,3],[4,5,6])

In [15]:
df

   0
4  1
5  2
6  3

In [7]:
import numpy as np

In [8]:
a = np.random.rand(5,4)

In [18]:
a

array([[0.77892565, 0.57310029, 0.23620307, 0.08517702],
       [0.2200094 , 0.62806894, 0.88843141, 0.48827027],
       [0.55305267, 0.60809611, 0.74264761, 0.61507927],
       [0.60135664, 0.50235371, 0.64469293, 0.64571891],
       [0.51100684, 0.12797174, 0.92951289, 0.00840649]])

In [9]:
df = pd.DataFrame(a,["a","b","c","d","e"],["col1","col2","col3", "col4"])

In [10]:
df

       col1      col2      col3      col4
a  0.247461  0.270202  0.600344  0.042924
b  0.586221  0.860569  0.248743  0.354226
c  0.907581  0.761704  0.520402  0.018482
d  0.032427  0.062353  0.918982  0.344523
e  0.813755  0.607127  0.841108  0.111314

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      float64
 1   col2    5 non-null      float64
 2   col3    5 non-null      float64
 3   col4    5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [23]:
df.describe()

           col1      col2      col3      col4
count  5.000000  5.000000  5.000000  5.000000
mean   0.532870  0.487918  0.688298  0.368530
std    0.202485  0.206828  0.277256  0.300806
min    0.220009  0.127972  0.236203  0.008406
25%    0.511007  0.502354  0.644693  0.085177
50%    0.553053  0.573100  0.742648  0.488270
75%    0.601357  0.608096  0.888431  0.615079
max    0.778926  0.628069  0.929513  0.645719

In [38]:
df.rename(columns= {"col":"col1"},inplace= True)

In [39]:
df

       col1      col2      col3      col4
p  0.778926  0.573100  0.236203  0.085177
q  0.220009  0.628069  0.888431  0.488270
r  0.553053  0.608096  0.742648  0.615079
s  0.601357  0.502354  0.644693  0.645719
t  0.511007  0.127972  0.929513  0.008406

In [40]:
df.rename(index= {"a":"p", "b":"q", "c":"r", "d":"s", "e":"t"},inplace =True)

In [41]:
df

       col1      col2      col3      col4
p  0.778926  0.573100  0.236203  0.085177
q  0.220009  0.628069  0.888431  0.488270
r  0.553053  0.608096  0.742648  0.615079
s  0.601357  0.502354  0.644693  0.645719
t  0.511007  0.127972  0.929513  0.008406

In [43]:
df["col1"]   # calling the colomn

p    0.778926
q    0.220009
r    0.553053
s    0.601357
t    0.511007
Name: col1, dtype: float64

In [50]:
df[["col1","col4"]] # fetching list of coloumns

       col1      col4
p  0.778926  0.085177
q  0.220009  0.488270
r  0.553053  0.615079
s  0.601357  0.645719
t  0.511007  0.008406

In [53]:
#select row from Data Frame
df.loc["p":"r"]

       col1      col2      col3      col4
p  0.778926  0.573100  0.236203  0.085177
q  0.220009  0.628069  0.888431  0.488270
r  0.553053  0.608096  0.742648  0.615079

In [55]:
df.loc["p":"s",["col2","col4"]]   #fecthing p to s rows and col2 and col4

       col2      col4
p  0.573100  0.085177
q  0.628069  0.488270
r  0.608096  0.615079
s  0.502354  0.645719

In [56]:
df.iloc[0:3,1:3]

       col2      col3
p  0.573100  0.236203
q  0.628069  0.888431
r  0.608096  0.742648

In [13]:
df.iloc[2:,-1:]

       col4
c  0.018482
d  0.344523
e  0.111314

In [17]:
import numpy as np
df1=pd.DataFrame({"A":[1,2,np.nan],"B":[5,np.nan,None], "C":[4,None,5]})

In [18]:
df1

     A    B    C
0  1.0  5.0  4.0
1  2.0  NaN  NaN
2  NaN  NaN  5.0

In [20]:
df.isna

<bound method DataFrame.isna of        col1      col2      col3      col4
a  0.247461  0.270202  0.600344  0.042924
b  0.586221  0.860569  0.248743  0.354226
c  0.907581  0.761704  0.520402  0.018482
d  0.032427  0.062353  0.918982  0.344523
e  0.813755  0.607127  0.841108  0.111314>

In [22]:
df1.isna()

       A      B      C
0  False  False  False
1  False   True   True
2   True   True  False

In [23]:
df1.isna().sum() #it checks for NaN value coloumn wise

A    1
B    2
C    1
dtype: int64

In [25]:
df1.dropna() # it drops all rows having NaN

     A    B    C
0  1.0  5.0  4.0

In [26]:
df1

     A    B    C
0  1.0  5.0  4.0
1  2.0  NaN  NaN
2  NaN  NaN  5.0

In [27]:
df1.dropna(axis =1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [28]:
df1

     A    B    C
0  1.0  5.0  4.0
1  2.0  NaN  NaN
2  NaN  NaN  5.0

In [29]:
df1.mean()

A    1.5
B    5.0
C    4.5
dtype: float64

In [32]:
df1["A"].fillna(df1["A"].mean(),inplace=True)

In [33]:
df1

     A    B    C
0  1.0  5.0  4.0
1  2.0  NaN  NaN
2  1.5  NaN  5.0

In [34]:
df1.fillna(df1.mean()) # fills mean coloumn wise

     A    B    C
0  1.0  5.0  4.0
1  2.0  5.0  4.5
2  1.5  5.0  5.0

In [43]:
#Group By
data= {"City":["Delhi","Lahor","Paro","Kathmandu","lala","Delhi"],
      "Country":["India","Pak","Bangladesh","Nepal","Bhutan","IND"],
       "GDP":[100,90,80,70,60,90]
      }

In [44]:
df2 = pd.DataFrame(data)

In [45]:
df2

        City     Country  GDP
0      Delhi       India  100
1      Lahor         Pak   90
2       Paro  Bangladesh   80
3  Kathmandu       Nepal   70
4       lala      Bhutan   60
5      Delhi         IND   90

In [47]:
gb=df2.groupby("City")

In [48]:
gb["GDP"].mean()

City
Delhi        95
Kathmandu    70
Lahor        90
Paro         80
lala         60
Name: GDP, dtype: int64

In [49]:
#Read and Write
df2.to_csv("country.csv")

In [50]:
import os

In [51]:
os.getcwd()

'/Users/amandeep'

In [53]:
df = pd.read_csv("/Users/amandeep/Downloads/Ecommerce Purchases")

In [55]:
df.head()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [58]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Address           10000 non-null  object
 1   Lot               10000 non-null  object
 2   AM or PM          10000 non-null  object
 3   Browser Info      10000 non-null  object
 4   Company           10000 non-null  object
 5   Credit Card       10000 non-null  int64
 6   CC Exp Date       10000 non-null  object
 7   CC Security Code  10000 non-null  int64
 8   CC Provider       10000 non-null  object
 9   Email             10000 non-null  object
 10  Job               10000 non-null  object
 11  IP Address        10000 non-null  object
 12  Language          10000 non-null  object
 13  Purchase Price    10000 non-null  float64
dtypes: float64(1), int64(2), object(11)
memory usage: 1.1+ MB

In [60]:
df.isna().sum()

Address             0
Lot                 0
AM or PM            0
Browser Info        0
Company             0
Credit Card         0
CC Exp Date         0
CC Security Code    0
CC Provider         0
Email               0
Job                 0
IP Address          0
Language            0
Purchase Price      0
dtype: int64

In [65]:
df["Purchase Price"].mean()

50.34730200000025

In [62]:
df.describe()

        Credit Card  CC Security Code  Purchase Price
count  1.000000e+04      10000.000000    10000.000000
mean   2.341374e+15        907.217800       50.347302
std    2.256103e+15       1589.693035       29.015836
min    6.040186e+10          0.000000        0.000000
25%    3.056322e+13        280.000000       25.150000
50%    8.699942e+14        548.000000       50.505000
75%    4.492298e+15        816.000000       75.770000
max    6.012000e+15       9993.000000       99.990000

In [77]:
gp = df.groupby("Language")

In [78]:
gp.count()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Purchase Price
Language,,,,,,,,,,,,,
de,1155,1155,1155,1155,1155,1155,1155,1155,1155,1155,1155,1155,1155
el,1137,1137,1137,1137,1137,1137,1137,1137,1137,1137,1137,1137,1137
en,1098,1098,1098,1098,1098,1098,1098,1098,1098,1098,1098,1098,1098
es,1095,1095,1095,1095,1095,1095,1095,1095,1095,1095,1095,1095,1095
fr,1097,1097,1097,1097,1097,1097,1097,1097,1097,1097,1097,1097,1097
it,1086,1086,1086,1086,1086,1086,1086,1086,1086,1086,1086,1086,1086
pt,1118,1118,1118,1118,1118,1118,1118,1118,1118,1118,1118,1118,1118
ru,1155,1155,1155,1155,1155,1155,1155,1155,1155,1155,1155,1155,1155
zh,1059,1059,1059,1059,1059,1059,1059,1059,1059,1059,1059,1059,1059

In [70]:
df[df["Language"]=="en"].count()

Address             1098
Lot                 1098
AM or PM            1098
Browser Info        1098
Company             1098
Credit Card         1098
CC Exp Date         1098
CC Security Code    1098
CC Provider         1098
Email               1098
Job                 1098
IP Address          1098
Language            1098
Purchase Price      1098
dtype: int64

In [83]:
df["Job"][df["Job"] == "Lawyer"].count()

30

In [85]:
gpp= df.groupby("AM or PM")

In [86]:
gpp.count()

,Address,Lot,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
AM or PM,,,,,,,,,,,,,
AM,4932,4932,4932,4932,4932,4932,4932,4932,4932,4932,4932,4932,4932
PM,5068,5068,5068,5068,5068,5068,5068,5068,5068,5068,5068,5068,5068

In [89]:
df["AM or PM"].value_counts() # counts the occurance of

PM    5068
AM    4932
Name: AM or PM, dtype: int64